#define _CRT_SECURE_NO_WARNINGS
//------------------------------------------//
//		kadai09 ピカタン					//
//------------------------------------------//
#include <stdio.h>
#include <string.h>
//------------プロトタイプ宣言--------------//
void waitkey();
bool length_check(char* name);
void ng_check(char* name, char ng[][9], int ngflag[2], int n);
//-----------------終わり-------------------//

//-----------------main関数-----------------//
int main(void) {

	bool lenflag = false;
	int ngflag[2] = { 0,0 };//1つ目：1ならtrue0ならfalse 2つ目：引っかかったngワードの場所

	char name[1024];//名前
	//最初が禁止単語の種類の数、次がそれぞれの文字数、数値のイメージだと最初が縦で次が横
	//10単語で改行しています
	char ng[][9] = {
		"ちんこ",   "まんこ",   "ちんちん", "まんまん", "ちんげ",   "ちん毛",   "まんげ",   "まん毛",   "エッチ",   "陰毛",
		"いんもう", "ま○こ",   "まんk",    "マソコ",   "まん個",   "ヴァギナ", "ちんk",    "チンポ",   "ペニス",   "penis",
		"きんたま", "肉棒",     "勃起",     "ボッキ",   "精子",     "射精",     "ザーメン", "セックス", "SEX",      "sex",
		"PENIS",    "S○X",     "s○x",     "体位",     "淫乱",     "アナル",   "あなる",   "anus",     "おっぱい", "oppai",
		"パンツ",   "パンティ", "パンt",    "乳首",     "ちくび",   "チクビ",   "ビーチク", "自慰",     "オナニ",   "オナヌ",
		"しこって", "しこしこ", "クンニ",   "フェラ",   "まんぐり", "パイズリ", "風俗",     "ふうぞく", "ふーぞく", "ソープ",
		"デリヘル", "姦",       "包茎",     "ほうけい", "童貞",     "どうてい", "どうてー", "どーてー", "どーてい", "性器",
		"処女",     "やりまん", "ヤリマン", "乱交",     "バイブ",   "ローター", "パイパン", "中出し",   "中田氏",   "なかだし",
		"スカトロ", "すかとろ", "糞",       "うんこ",   "ウンコ",   "パコパコ", "ぱこぱこ", "ホモ",     "homo",     "ぱいぱい",
		"パイパイ", "ノーブラ", "手コキ",   "てこき",   "テコキ",   "手マン",   "てまん",   "テマン",   "潮吹",     "指マン",
		"ゆびまん", "ユビマン", "チンコ",   "マンコ",   "チンチン", "マンマン", "インモウ", "レイプ",   "犯し",     "きもい",
		"キモイ",   "きめえ",   "きめぇ",   "変態",     "馬鹿",     "ばーか",   "ばか",     "バカ",     "baka",     "fuck",
		"ファック", "ブス",     "気違い",   "基地外",   "きちがい", "キチガイ", "ブタ",     "くたばれ", "bitch",    "ビッチ",
		"びっち",   "死",       "しね",     "氏ね",     "shine",    "ﾀﾋ",       "殺",       "ころす",   "コロス",   "シネ",
		"ころせ",   "コロセ",   "乞食",     "ばばあ",   "ばばぁ",   "バアア",   "ババァ",   "BBA",      "くず",     "屑",
		"クズ",     "大麻",     "麻薬",     "あいえき", "愛液",     "精液",     "せいえき", "いんぱい", "淫売",     "ちんぽ",
		"チンポ",   "どかた",   "土方",     "ひにん",   "びっこ",   "どもり",   "かたわ",   "くろんぼ", "ぺにす",   "けとう",
		"おちんこ", "おチンコ", "オチンコ", "おまんこ", "おマンコ", "オマンコ", "けとう",   "ごうかん", "めくら",   "やらせろ",
		"しなじん", "ろりこん", "ロリコン", "チン毛",   "マン毛",   "デンキチ", "でんきち",	"デン吉",   "でん吉",   "ふぐり",
		"あくめ",   "アクメ",   "あさだち", "アヌス",   "イメクラ", "いんかく", "いんぽ",   "ヴぁぎな", "うらすじ", "うわぞり",
		"えすえむ", "えすて",   "えむお",   "えむじ",   "えむじょ", "えむお",   "えれくと", "おうごん", "おかず",   "おさわり",
		"おなくら", "かうぱー", "がばまん", "かり",     "がんしゃ", "きとう",   "きょこん", "そーぷ",   "くさまん", "さげまん",
		"さろん",   "P",        "しおふき", "しかん",   "48手",     "したいれ"
	};

	int word_num = sizeof(ng) / 9;

	do {
		if (lenflag == true) {
			printf("文字長すぎィ！！！\n");
		}
		if (ngflag[0] == 1) {
			printf("%sを使うなんていけないぞ☆\n", ng[ngflag[1]]);
		}

		printf("名前を入力してね\n");
		scanf("%s", name);

		lenflag = length_check(name);
		ng_check(name, ng, ngflag, word_num);

	} while (ngflag[0] == 1 || lenflag == true);

	printf("勇者%sはエッチして死にました\n", name);
	waitkey();
	return 0;
}
//-----------------終わり-------------------//

//----------------waitkey関数---------------//
void waitkey() {
	rewind(stdin);
	getchar();
}
//-------------waitkey関数おわり------------//

//-------------length_check関数-------------//
bool length_check(char* name) {
	if (strlen(name) > 9) {
		return true;
	}
	return false;
}
//----------length_check関数おわり----------//

//---------------ng_check関数---------------//
void ng_check(char* name, char ng[][9], int ngflag[2], int n) {
	int i;
	for (i = 0; i < n; i++) {
		if (strstr(name, ng[i]) != NULL) {
			ngflag[0] = 1;
			ngflag[1] = i;
			return;
		}
	}
	ngflag[0] = 0;
}

//文字無理なら繰り返し
//OKなら文字列を合成させた文字列を表示